HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxInt_bf.h
/** \brief Mask for Ifx_INT_OIXS0_Bits.IRQ1 */
#define IFX_INT_OIXS0_IRQ1_MSK (0x3ffu)

/** \brief Offset for Ifx_INT_OIXS0_Bits.IRQ1 */
#define IFX_INT_OIXS0_IRQ1_OFF (16u)

/** \brief Length for Ifx_INT_OIXS1_Bits.IRQ2 */
#define IFX_INT_OIXS1_IRQ2_LEN (10u)

/** \brief Mask for Ifx_INT_OIXS1_Bits.IRQ2 */
#define IFX_INT_OIXS1_IRQ2_MSK (0x3ffu)

/** \brief Offset for Ifx_INT_OIXS1_Bits.IRQ2 */
#define IFX_INT_OIXS1_IRQ2_OFF (0u)

/** \brief Length for Ifx_INT_OIXS1_Bits.IRQ3 */
#define IFX_INT_OIXS1_IRQ3_LEN (10u)

/** \brief Mask for Ifx_INT_OIXS1_Bits.IRQ3 */
#define IFX_INT_OIXS1_IRQ3_MSK (0x3ffu)

/** \brief Offset for Ifx_INT_OIXS1_Bits.IRQ3 */
#define IFX_INT_OIXS1_IRQ3_OFF (16u)

/** \brief Length for Ifx_INT_OIT_Bits.TOS0 */
#define IFX_INT_OIT_TOS0_LEN (3u)

/** \brief Mask for Ifx_INT_OIT_Bits.TOS0 */
#define IFX_INT_OIT_TOS0_MSK (0x7u)

/** \brief Offset for Ifx_INT_OIT_Bits.TOS0 */
#define IFX_INT_OIT_TOS0_OFF (0u)

/** \brief Length for Ifx_INT_OIT_Bits.OE0 */
#define IFX_INT_OIT_OE0_LEN (1u)

/** \brief Mask for Ifx_INT_OIT_Bits.OE0 */
#define IFX_INT_OIT_OE0_MSK (0x1u)

/** \brief Offset for Ifx_INT_OIT_Bits.OE0 */
#define IFX_INT_OIT_OE0_OFF (7u)

/** \brief Length for Ifx_INT_OIT_Bits.TOS1 */
#define IFX_INT_OIT_TOS1_LEN (3u)

/** \brief Mask for Ifx_INT_OIT_Bits.TOS1 */
#define IFX_INT_OIT_TOS1_MSK (0x7u)

/** \brief Offset for Ifx_INT_OIT_Bits.TOS1 */
#define IFX_INT_OIT_TOS1_OFF (8u)

/** \brief Length for Ifx_INT_OIT_Bits.OE1 */
#define IFX_INT_OIT_OE1_LEN (1u)

/** \brief Mask for Ifx_INT_OIT_Bits.OE1 */
#define IFX_INT_OIT_OE1_MSK (0x1u)

/** \brief Offset for Ifx_INT_OIT_Bits.OE1 */
#define IFX_INT_OIT_OE1_OFF (15u)

/** \brief Length for Ifx_INT_OMISP_Bits.OTGB0 */
#define IFX_INT_OMISP_OTGB0_LEN (16u)

/** \brief Mask for Ifx_INT_OMISP_Bits.OTGB0 */
#define IFX_INT_OMISP_OTGB0_MSK (0xffffu)

/** \brief Offset for Ifx_INT_OMISP_Bits.OTGB0 */
#define IFX_INT_OMISP_OTGB0_OFF (0u)

/** \brief Length for Ifx_INT_OMISP_Bits.OTGB1 */
#define IFX_INT_OMISP_OTGB1_LEN (16u)

/** \brief Mask for Ifx_INT_OMISP_Bits.OTGB1 */
#define IFX_INT_OMISP_OTGB1_MSK (0xffffu)

/** \brief Offset for Ifx_INT_OMISP_Bits.OTGB1 */
#define IFX_INT_OMISP_OTGB1_OFF (16u)

/** \brief Length for Ifx_INT_OMISN_Bits.OTGB0 */
#define IFX_INT_OMISN_OTGB0_LEN (16u)

/** \brief Mask for Ifx_INT_OMISN_Bits.OTGB0 */
#define IFX_INT_OMISN_OTGB0_MSK (0xffffu)

/** \brief Offset for Ifx_INT_OMISN_Bits.OTGB0 */
#define IFX_INT_OMISN_OTGB0_OFF (0u)

/** \brief Length for Ifx_INT_OMISN_Bits.OTGB1 */
#define IFX_INT_OMISN_OTGB1_LEN (16u)

/** \brief Mask for Ifx_INT_OMISN_Bits.OTGB1 */
#define IFX_INT_OMISN_OTGB1_MSK (0xffffu)

/** \brief Offset for Ifx_INT_OMISN_Bits.OTGB1 */
#define IFX_INT_OMISN_OTGB1_OFF (16u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN0 */
#define IFX_INT_ACCEN_CONFIG0_EN0_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN0 */
#define IFX_INT_ACCEN_CONFIG0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN0 */
#define IFX_INT_ACCEN_CONFIG0_EN0_OFF (0u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN1 */
#define IFX_INT_ACCEN_CONFIG0_EN1_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN1 */
#define IFX_INT_ACCEN_CONFIG0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN1 */
#define IFX_INT_ACCEN_CONFIG0_EN1_OFF (1u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN2 */
#define IFX_INT_ACCEN_CONFIG0_EN2_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN2 */
#define IFX_INT_ACCEN_CONFIG0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN2 */
#define IFX_INT_ACCEN_CONFIG0_EN2_OFF (2u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN3 */
#define IFX_INT_ACCEN_CONFIG0_EN3_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN3 */
#define IFX_INT_ACCEN_CONFIG0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN3 */
#define IFX_INT_ACCEN_CONFIG0_EN3_OFF (3u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN4 */
#define IFX_INT_ACCEN_CONFIG0_EN4_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN4 */
#define IFX_INT_ACCEN_CONFIG0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN4 */
#define IFX_INT_ACCEN_CONFIG0_EN4_OFF (4u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN5 */
#define IFX_INT_ACCEN_CONFIG0_EN5_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN5 */
#define IFX_INT_ACCEN_CONFIG0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN5 */
#define IFX_INT_ACCEN_CONFIG0_EN5_OFF (5u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN6 */
#define IFX_INT_ACCEN_CONFIG0_EN6_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN6 */
#define IFX_INT_ACCEN_CONFIG0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN6 */
#define IFX_INT_ACCEN_CONFIG0_EN6_OFF (6u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN7 */
#define IFX_INT_ACCEN_CONFIG0_EN7_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN7 */
#define IFX_INT_ACCEN_CONFIG0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN7 */
#define IFX_INT_ACCEN_CONFIG0_EN7_OFF (7u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN8 */
#define IFX_INT_ACCEN_CONFIG0_EN8_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN8 */
#define IFX_INT_ACCEN_CONFIG0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN8 */
#define IFX_INT_ACCEN_CONFIG0_EN8_OFF (8u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN9 */
#define IFX_INT_ACCEN_CONFIG0_EN9_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN9 */
#define IFX_INT_ACCEN_CONFIG0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN9 */
#define IFX_INT_ACCEN_CONFIG0_EN9_OFF (9u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN10 */
#define IFX_INT_ACCEN_CONFIG0_EN10_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN10 */
#define IFX_INT_ACCEN_CONFIG0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN10 */
#define IFX_INT_ACCEN_CONFIG0_EN10_OFF (10u)

/** \brief Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN11 */
#define IFX_INT_ACCEN_CONFIG0_EN11_LEN (1u)

/** \brief Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN11 */
#define IFX_INT_ACCEN_CONFIG0_EN11_MSK (0x1u)

